import React from 'react';
import './article.styl'

const Article = () => {
    return(
        <div className="article">
            <h2 className="article__heading">Абелевы группы как артиновы или нетеровы модули над кольцами эндоморфизмов</h2>
            <time className="article__time" dateTime="2014-01-01">01/01/2014</time>
            <p className="article__text">
                Описаны абелевы группы A и B такие, что группа гомоморфизмов Hom(A,B) является артиновым модулем над кольцом эндоморфизмов группы B. Описание групп A и B, для которых группа Hom(A,B) является артиновым модулем над кольцом эндоморфизмов группы A, сведена к случаю, когда группа A не имеет кручения, а группа B либо квазициклическая группа, либо делимая группа без кручения. Охарактеризованы абелевы группы A и B, для которых группа Hom(A,B) есть нётеров модуль над кольцом E(A) или E(B). Исследование произвольной абелевой группы с нётеровым слева кольцом эндоморфизмов сведено к исследованию группы без кручения с нётеровым слева кольцом эндоморфизмов. Исследование группы с нётеровым справа кольцом эндоморфизмов осталось незавершённым. Описаны сепарабельные абелевы группы без кручения с нётеровыми слева или справа кольцами эндоморфизмов.
                <br/><br/>
                Описаны абелевы группы A и B такие, что группа гомоморфизмов Hom(A,B) является артиновым модулем над кольцом эндоморфизмов группы B. Описание групп A и B, для которых группа Hom(A,B) является артиновым модулем над кольцом эндоморфизмов группы A, сведена к случаю, когда группа A не имеет кручения, а группа B либо квазициклическая группа, либо делимая группа без кручения. Охарактеризованы абелевы группы A и B, для которых группа Hom(A,B) есть нётеров модуль над кольцом E(A) или E(B). Исследование произвольной абелевой группы с нётеровым слева кольцом эндоморфизмов сведено к исследованию группы без кручения с нётеровым слева кольцом эндоморфизмов. Исследование группы с нётеровым справа кольцом эндоморфизмов осталось незавершённым. Описаны сепарабельные абелевы группы без кручения с нётеровыми слева или справа кольцами эндоморфизмов.
            </p>
        </div>
    )
};

export default Article;